Revit 2027 API
FabricationConfiguration.GetAllSeamIds Method
 Gets all available seam identifiers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetAllSeamIds()
Public Function GetAllSeamIds As IList(Of Integer)
public:
IList<int>^ GetAllSeamIds()
member GetAllSeamIds : unit -> IList<int>
Return Value
IList<Int32>
 Returns an array of available seam identifiers.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace